wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_sai.h
/*!
    \file    gd32h77x_sai.h
    \brief   definitions for the SAI

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_SAI_H
#define GD32H77X_SAI_H

#include "gd32h77x.h"

/* SAI definitions */
#define SAI0                            (SAI_BASE + 0x00000000U)                    /*!< SAI0 base address */
#define SAI1                            (SAI_BASE + 0x00000400U)                    /*!< SAI1 base address */
#define SAI2                            (SAI_BASE + 0x00000800U)                    /*!< SAI2 base address */
#define SAI3                            (SAI_BASE + 0x00001000U)                    /*!< SAI3 base address */

/* registers definitions */
#define SAI_SYNCFG(saix)                REG32((saix) + 0x00000000U)                 /*!< SAI synchronize configuration register */
#define SAI_B0CFG0(saix)                REG32((saix) + 0x00000004U)                 /*!< SAI Block 0 configuration register0 */
#define SAI_B0CFG1(saix)                REG32((saix) + 0x00000008U)                 /*!< SAI Block 0 configuration register1 */
#define SAI_B0FCFG(saix)                REG32((saix) + 0x0000000CU)                 /*!< SAI Block 0 frame configuration register */
#define SAI_B0SCFG(saix)                REG32((saix) + 0x00000010U)                 /*!< SAI Block 0 slot configuration register */
#define SAI_B0INTEN(saix)               REG32((saix) + 0x00000014U)                 /*!< SAI Block 0 interrupt enable register  */
#define SAI_B0STAT(saix)                REG32((saix) + 0x00000018U)                 /*!< SAI Block 0 status register */
#define SAI_B0INTC(saix)                REG32((saix) + 0x0000001CU)                 /*!< SAI Block 0 interrupt flag clear register */
#define SAI_B0DATA(saix)                REG32((saix) + 0x00000020U)                 /*!< SAI Block 0 data register */
#define SAI_B1CFG0(saix)                REG32((saix) + 0x00000024U)                 /*!< SAI Block 1 configuration register0 */
#define SAI_B1CFG1(saix)                REG32((saix) + 0x00000028U)                 /*!< SAI Block 1 configuration register1 */
#define SAI_B1FCFG(saix)                REG32((saix) + 0x0000002CU)                 /*!< SAI Block 1 frame configuration register */
#define SAI_B1SCFG(saix)                REG32((saix) + 0x00000030U)                 /*!< SAI Block 1 slot configuration register */
#define SAI_B1INTEN(saix)               REG32((saix) + 0x00000034U)                 /*!< SAI Block 1 interrupt enable register  */
#define SAI_B1STAT(saix)                REG32((saix) + 0x00000038U)                 /*!< SAI Block 1 status register */
#define SAI_B1INTC(saix)                REG32((saix) + 0x0000003CU)                 /*!< SAI Block 1 interrupt flag clear register */
#define SAI_B1DATA(saix)                REG32((saix) + 0x00000040U)                 /*!< SAI Block 1 data register */
#define SAI_PDMCTL(saix)                REG32((saix) + 0x00000044U)                 /*!< SAI PDM control register */
#define SAI_PDMCFG(saix)                REG32((saix) + 0x00000048U)                 /*!< SAI PDM configuration register */

#define SAI_CFG0(saix,blocky)           REG32(((saix) + 0x00000004U) + 0x20U*(blocky))    /*!< SAI Block configuration register0 */
#define SAI_CFG1(saix,blocky)           REG32(((saix) + 0x00000008U) + 0x20U*(blocky))    /*!< SAI Block configuration register1 */
#define SAI_FCFG(saix,blocky)           REG32(((saix) + 0x0000000CU) + 0x20U*(blocky))    /*!< SAI Block frame configuration register */
#define SAI_SCFG(saix,blocky)           REG32(((saix) + 0x00000010U) + 0x20U*(blocky))    /*!< SAI Block slot configuration register */
#define SAI_INTEN(saix,blocky)          REG32(((saix) + 0x00000014U) + 0x20U*(blocky))    /*!< SAI Block interrupt enable register  */
#define SAI_STAT(saix,blocky)           REG32(((saix) + 0x00000018U) + 0x20U*(blocky))    /*!< SAI Block status register */
#define SAI_INTC(saix,blocky)           REG32(((saix) + 0x0000001CU) + 0x20U*(blocky))    /*!< SAI Block interrupt flag clear register */
#define SAI_DATA(saix,blocky)           REG32(((saix) + 0x00000020U) + 0x20U*(blocky))    /*!< SAI Block data register */

/* bits definitions */
/* SAI_SYNCFG */
#define SAI_SYNCFG_SYNI                 BITS(0,1)                                   /*!< synchronization inputs */
#define SAI_SYNCFG_SYNO                 BITS(4,5)                                   /*!< synchronization outputs */

/* SAI_CFG0 */
#define SAI_CFG0_OPTMOD                 BITS(0,1)                                   /*!< operating mode */
#define SAI_CFG0_PROT                   BITS(2,3)                                   /*!< protocol selection */
#define SAI_CFG0_DATAWD                 BITS(5,7)                                   /*!< data width */
#define SAI_CFG0_SHIFTDIR               BIT(8)                                      /*!< shift direction */
#define SAI_CFG0_SAMPEDGE               BIT(9)                                      /*!< sampling clock edge */
#define SAI_CFG0_SYNCMOD                BITS(10,11)                                 /*!< synchronization mode */
#define SAI_CFG0_MONO                   BIT(12)                                     /*!< stereo and mono mode selection */
#define SAI_CFG0_ODRIV                  BIT(13)                                     /*!< output drive */
#define SAI_CFG0_SAIEN                  BIT(16)                                     /*!< sai sub-block enable */
#define SAI_CFG0_DMAEN                  BIT(17)                                     /*!< DMA enable */
#define SAI_CFG0_BYPASS                 BIT(19)                                     /*!< clock divider logic bypass */
#define SAI_CFG0_MDIV                   BITS(20,25)                                 /*!< master clock divider ratio */
#define SAI_CFG0_MOSPR                  BIT(26)                                     /*!< the master clock oversampling rate */
#define SAI_CFG0_MCLKEN                 BIT(27)                                     /*!< the master clock enable */

/* SAI_CFG1 */
#define SAI_CFG1_FFTH                   BITS(0,2)                                   /*!< FIFO threshold */
#define SAI_CFG1_FLUSH                  BIT(3)                                      /*!< FIFO flush */
#define SAI_CFG1_SDOM                   BIT(4)                                      /*!< serial data output management */
#define SAI_CFG1_MT                     BIT(5)                                      /*!< mute mode on */
#define SAI_CFG1_MTVAL                  BIT(6)                                      /*!< mute value */
#define SAI_CFG1_MTFCNT                 BITS(7,12)                                  /*!< mute frame count */
#define SAI_CFG1_CPLMOD                 BIT(13)                                     /*!< complement mode */
#define SAI_CFG1_CPAMOD                 BITS(14,15)                                 /*!< compander mode */

/* SAI_FCFG */
#define SAI_FCFG_FWD                    BITS(0,7)                                   /*!< frame width */
#define SAI_FCFG_FSAWD                  BITS(8,14)                                  /*!< frame synchronization active width */
#define SAI_FCFG_FSFUNC                 BIT(16)                                     /*!< frame synchronization function */
#define SAI_FCFG_FSPL                   BIT(17)                                     /*!< Frame synchronization active polarity */
#define SAI_FCFG_FSOST                  BIT(18)                                     /*!< frame synchronization offset */

/* SAI_SCFG */
#define SAI_SCFG_DATAOST                BITS(0,4)                                   /*!< data offset */
#define SAI_SCFG_SLOTWD                 BITS(6,7)                                   /*!< slot width */
#define SAI_SCFG_SLOTNUM                BITS(8,11)                                  /*!< slot number within frame */
#define SAI_SCFG_SLOTAV                 BITS(16,31)                                 /*!< slot activation vector */

/* SAI_INTEN */
#define SAI_INTEN_OUERRIE               BIT(0)                                      /*!< FIFO overrun or underrun interrupt enable */
#define SAI_INTEN_MTDETIE               BIT(1)                                      /*!< mute detection interrupt enable */
#define SAI_INTEN_ERRCKIE               BIT(2)                                      /*!< error clock interrupt enable */
#define SAI_INTEN_FFREQIE               BIT(3)                                      /*!< FIFO request interrupt enable */
#define SAI_INTEN_ACNRDYIE              BIT(4)                                      /*!< audio codec not ready interrupt enable */
#define SAI_INTEN_FSADETIE              BIT(5)                                      /*!< frame synchronization advanced detection interrupt enable */
#define SAI_INTEN_FSPDETIE              BIT(6)                                      /*!< frame synchronization postpone detection interrupt enable */

/* SAI_STAT */
#define SAI_STAT_OUERR                  BIT(0)                                      /*!< FIFO overrun or underrun */
#define SAI_STAT_MTDET                  BIT(1)                                      /*!< mute detection */
#define SAI_STAT_ERRCK                  BIT(2)                                      /*!< error clock */
#define SAI_STAT_FFREQ                  BIT(3)                                      /*!< FIFO request */
#define SAI_STAT_ACNRDY                 BIT(4)                                      /*!< audio codec not ready */
#define SAI_STAT_FSADET                 BIT(5)                                      /*!< frame synchronization advanced detection */
#define SAI_STAT_FSPDET                 BIT(6)                                      /*!< frame synchronization postpone detection */
#define SAI_STAT_FFSTAT                 BITS(16,18)                                 /*!< FIFO status */

