wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_sai.h
/* SAI_INTC */
#define SAI_INTC_OUERRC                 BIT(0)                                      /*!< FIFO overrun or underrun interrupt clear */
#define SAI_INTC_MTDETC                 BIT(1)                                      /*!< mute detection interrupt clear */
#define SAI_INTC_ERRCKC                 BIT(2)                                      /*!< error clock interrupt clear */
#define SAI_INTC_ACNRDYC                BIT(4)                                      /*!< audio codec not ready interrupt clear */
#define SAI_INTC_FSADETC                BIT(5)                                      /*!< frame synchronization advanced detection interrupt clear */
#define SAI_INTC_FSPDETC                BIT(6)                                      /*!< frame synchronization postpone detection interrupt clear */

/* SAI_DATA */
#define SAI_DATA_DATA                   BITS(0,31)                                  /*!< transfer data or receive data */

/* SAI_PDMCTL */
#define SAI_PDMCTL_PDMEN                BIT(0)                                      /*!< PDM enable */
#define SAI_PDMCTL_MICNUMSEL            BITS(4,5)                                   /*!< microphones number selected */
#define SAI_PDMCTL_CLKL0EN              BIT(8)                                      /*!< PDM clock line 0 enable */
#define SAI_PDMCTL_CLKL1EN              BIT(9)                                      /*!< PDM clock line 1 enable */

/* SAI_PDMCFG */
#define SAI_PDMCFG_DPL0                 BITS(0,2)                                   /*!< the 0 group of left channel microphone data flow delay period */
#define SAI_PDMCFG_DPR0                 BITS(4,6)                                   /*!< the 0 group of right channel microphone data flow delay period */
#define SAI_PDMCFG_DPL1                 BITS(8,10)                                  /*!< the 1st group of left channel microphone data flow delay period */
#define SAI_PDMCFG_DPR1                 BITS(12,14)                                 /*!< the 1st group of right channel microphone data flow delay period */
#define SAI_PDMCFG_DPL2                 BITS(16,18)                                 /*!< the 2nd group of left channel microphone data flow delay period */
#define SAI_PDMCFG_DPR2                 BITS(20,22)                                 /*!< the 2nd group of right channel microphone data flow delay period */
#define SAI_PDMCFG_DPL3                 BITS(24,26)                                 /*!< the 3rd group of left channel microphone data flow delay period */
#define SAI_PDMCFG_DPR3                 BITS(28,30)                                 /*!< the 3rd group of right channel microphone data flow delay period */

/* constants definitions */
/* SAI initialize parameter struct definitions */
typedef struct {
    uint32_t operating_mode;                                                        /*!< operating mode */
    uint32_t protocol;                                                              /*!< protocol selection */
    uint32_t data_width;                                                            /*!< data width */
    uint32_t shift_dir;                                                             /*!< shift direction */
    uint32_t sample_edge;                                                           /*!< sampling clock edge */
    uint32_t sync_mode;                                                             /*!< synchronization mode */
    uint32_t output_drive;                                                          /*!< output drive */
    uint32_t clk_div_bypass;                                                        /*!< clock divider logic bypass */
    uint32_t mclk_div;                                                              /*!< master clock divider ratio */
    uint32_t mclk_oversampling;                                                     /*!< the master clock oversampling rate */
    uint32_t mclk_enable;                                                           /*!< the master clock enable */
    uint32_t fifo_threshold;                                                        /*!< FIFO threshold */
} sai_parameter_struct;

/* SAI frame initialize parameter struct definitions */
typedef struct {
    uint32_t frame_width;                                                           /*!< frame width */
    uint32_t frame_sync_width;                                                      /*!< frame synchronization active width */
    uint32_t frame_sync_function;                                                   /*!< frame synchronization function */
    uint32_t frame_sync_polarity;                                                   /*!< frame synchronization active polarity */
    uint32_t frame_sync_offset;                                                     /*!< frame synchronization offset */
} sai_frame_parameter_struct;

/* SAI slot initialize parameter struct definitions */
typedef struct {
    uint32_t slot_number;                                                           /*!< slot number */
    uint32_t slot_width;                                                            /*!< slot width */
    uint32_t data_offset;                                                           /*!< data offset */
    uint32_t slot_active;                                                           /*!< slot activation vector */
} sai_slot_parameter_struct;

/* SAI FIFO status */
typedef enum {
    FIFO_EMPTY  = 0U,                                                               /*!< empty */
    FIFO_EMPTY_TO_1_4_FULL,                                                         /*!< empty < fifo_level <= 1/4_full. */
    FIFO_1_4_FULL_TO_1_2_FULL,                                                      /*!< 1/4_full < fifo_level <= 1/2_full. */
    FIFO_1_2_FULL_TO_3_4_FULL,                                                      /*!< 1/2_full < fifo_level <= 3/4_full. */
    FIFO_3_4_FULL_TO_FULL,                                                          /*!< 3/4_full < fifo_level < full */
    FIFO_FULL                                                                       /*!< full */
} sai_fifo_state_enum;

/* SAI synchronization output definitions */
#define SYNCFG_SYNO(regval)             (BITS(4,5)&((uint32_t)(regval) << 4U))
#define SAI_SYNCOUTPUT_OFF              SYNCFG_SYNO(0)                              /*!< no synchronization output signals */
#define SAI_SYNCOUTPUT_BLOCK0           SYNCFG_SYNO(1)                              /*!< block 0 used for further synchronization for others SAI */
#define SAI_SYNCOUTPUT_BLOCK1           SYNCFG_SYNO(2)                              /*!< block 1 used for further synchronization for others SAI */

/* SAI synchronization input definitions */
#define SYNCFG_SYNI(regval)             (BITS(0,1)&((uint32_t)(regval) << 0U))
#define SAI_SYNCINPUT_SAI0              SYNCFG_SYNI(0)                              /*!< SAI 1/2/3 selects the synchronization coming from SAI 0 */
#define SAI_SYNCINPUT_SAI1              SYNCFG_SYNI(1)                              /*!< SAI 0/2/3 selects the synchronization coming from SAI 1 */
#define SAI_SYNCINPUT_SAI2              SYNCFG_SYNI(2)                              /*!< SAI 0/1/3 selects the synchronization coming from SAI 2 */
#define SAI_SYNCINPUT_SAI3              SYNCFG_SYNI(3)                              /*!< SAI 0/1/2 selects the synchronization coming from SAI 3 */

/* SAI master clock enable */
#define SAI_MCLK_DISABLE               ((uint32_t)0x00000000U)                      /*!< the master clock is disable when SAI enable */
#define SAI_MCLK_ENABLE                 SAI_CFG0_MCLKEN                             /*!< the master clock is enable now */

/* SAI master clock oversampling rate */
#define SAI_MCLK_OVERSAMP_256          ((uint32_t)0x00000000U)                      /*!< MCLK = 256 * Ffs */
#define SAI_MCLK_OVERSAMP_512           SAI_CFG0_MOSPR                              /*!< MCLK = 512 * Ffs */

